espressif/esp-idf/components/soc/esp32s2/register/soc/cp_dma_reg.h
/*
 * SPDX-FileCopyrightText: 2020-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0 OR MIT
 */

#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** CP_DMA_INT_RAW_REG register
 *  Raw interrupt status
 */
#define CP_DMA_INT_RAW_REG (DR_REG_CP_BASE + 0x0)
/** CP_DMA_IN_DONE_INT_RAW : RO; bitpos: [0]; default: 0;
 *  This is the interrupt raw bit. Triggered when the last data of frame is received or
 *  the receive buffer is full indicated by inlink descriptor.
 */
#define CP_DMA_IN_DONE_INT_RAW    (BIT(0))
#define CP_DMA_IN_DONE_INT_RAW_M  (CP_DMA_IN_DONE_INT_RAW_V << CP_DMA_IN_DONE_INT_RAW_S)
#define CP_DMA_IN_DONE_INT_RAW_V  0x00000001
#define CP_DMA_IN_DONE_INT_RAW_S  0
/** CP_DMA_IN_SUC_EOF_INT_RAW : RO; bitpos: [1]; default: 0;
 *  This is the interrupt raw bit. Triggered when the last data of one frame is
 *  received.
 */
#define CP_DMA_IN_SUC_EOF_INT_RAW    (BIT(1))
#define CP_DMA_IN_SUC_EOF_INT_RAW_M  (CP_DMA_IN_SUC_EOF_INT_RAW_V << CP_DMA_IN_SUC_EOF_INT_RAW_S)
#define CP_DMA_IN_SUC_EOF_INT_RAW_V  0x00000001
#define CP_DMA_IN_SUC_EOF_INT_RAW_S  1
/** CP_DMA_OUT_DONE_INT_RAW : RO; bitpos: [2]; default: 0;
 *  This is the interrupt raw bit. Triggered when all data indicated by one outlink
 *  descriptor has been pushed into Tx FIFO.
 */
#define CP_DMA_OUT_DONE_INT_RAW    (BIT(2))
#define CP_DMA_OUT_DONE_INT_RAW_M  (CP_DMA_OUT_DONE_INT_RAW_V << CP_DMA_OUT_DONE_INT_RAW_S)
#define CP_DMA_OUT_DONE_INT_RAW_V  0x00000001
#define CP_DMA_OUT_DONE_INT_RAW_S  2
/** CP_DMA_OUT_EOF_INT_RAW : RO; bitpos: [3]; default: 0;
 *  This is the interrupt raw bit. Triggered when the last data with EOF flag has been
 *  pushed into Tx FIFO.
 */
#define CP_DMA_OUT_EOF_INT_RAW    (BIT(3))
#define CP_DMA_OUT_EOF_INT_RAW_M  (CP_DMA_OUT_EOF_INT_RAW_V << CP_DMA_OUT_EOF_INT_RAW_S)
#define CP_DMA_OUT_EOF_INT_RAW_V  0x00000001
#define CP_DMA_OUT_EOF_INT_RAW_S  3
/** CP_DMA_IN_DSCR_ERR_INT_RAW : RO; bitpos: [4]; default: 0;
 *  This is the interrupt raw bit. Triggered when detecting inlink descriptor error,
 *  including owner error, the second and third word error of inlink descriptor.
 */
#define CP_DMA_IN_DSCR_ERR_INT_RAW    (BIT(4))
#define CP_DMA_IN_DSCR_ERR_INT_RAW_M  (CP_DMA_IN_DSCR_ERR_INT_RAW_V << CP_DMA_IN_DSCR_ERR_INT_RAW_S)
#define CP_DMA_IN_DSCR_ERR_INT_RAW_V  0x00000001
#define CP_DMA_IN_DSCR_ERR_INT_RAW_S  4
/** CP_DMA_OUT_DSCR_ERR_INT_RAW : RO; bitpos: [5]; default: 0;
 *  This is the interrupt raw bit. Triggered when detecting outlink descriptor error,
 *  including owner error, the second and third word error of outlink descriptor.
 */
#define CP_DMA_OUT_DSCR_ERR_INT_RAW    (BIT(5))
#define CP_DMA_OUT_DSCR_ERR_INT_RAW_M  (CP_DMA_OUT_DSCR_ERR_INT_RAW_V << CP_DMA_OUT_DSCR_ERR_INT_RAW_S)
#define CP_DMA_OUT_DSCR_ERR_INT_RAW_V  0x00000001
#define CP_DMA_OUT_DSCR_ERR_INT_RAW_S  5
/** CP_DMA_IN_DSCR_EMPTY_INT_RAW : RO; bitpos: [6]; default: 0;
 *  This is the interrupt raw bit. Triggered when receiving data is completed and no
 *  more inlink descriptor.
 */
#define CP_DMA_IN_DSCR_EMPTY_INT_RAW    (BIT(6))
#define CP_DMA_IN_DSCR_EMPTY_INT_RAW_M  (CP_DMA_IN_DSCR_EMPTY_INT_RAW_V << CP_DMA_IN_DSCR_EMPTY_INT_RAW_S)
#define CP_DMA_IN_DSCR_EMPTY_INT_RAW_V  0x00000001
#define CP_DMA_IN_DSCR_EMPTY_INT_RAW_S  6
/** CP_DMA_OUT_TOTAL_EOF_INT_RAW : RO; bitpos: [7]; default: 0;
 *  This is the interrupt raw bit. Triggered when data corresponding to all outlink
 *  descriptor and the last descriptor with valid EOF is transmitted out.
 */
#define CP_DMA_OUT_TOTAL_EOF_INT_RAW    (BIT(7))
#define CP_DMA_OUT_TOTAL_EOF_INT_RAW_M  (CP_DMA_OUT_TOTAL_EOF_INT_RAW_V << CP_DMA_OUT_TOTAL_EOF_INT_RAW_S)
#define CP_DMA_OUT_TOTAL_EOF_INT_RAW_V  0x00000001
#define CP_DMA_OUT_TOTAL_EOF_INT_RAW_S  7
/** CP_DMA_CRC_DONE_INT_RAW : RO; bitpos: [8]; default: 0;
 *  This is the interrupt raw bit. Triggered when crc calculation is done.
 */
#define CP_DMA_CRC_DONE_INT_RAW    (BIT(8))
#define CP_DMA_CRC_DONE_INT_RAW_M  (CP_DMA_CRC_DONE_INT_RAW_V << CP_DMA_CRC_DONE_INT_RAW_S)
#define CP_DMA_CRC_DONE_INT_RAW_V  0x00000001
#define CP_DMA_CRC_DONE_INT_RAW_S  8

/** CP_DMA_INT_ST_REG register
 *  Masked interrupt status
 */
#define CP_DMA_INT_ST_REG (DR_REG_CP_BASE + 0x4)
/** CP_DMA_IN_DONE_INT_ST : RO; bitpos: [0]; default: 0;
 *  This is the masked interrupt bit for cp_in_done_int interrupt when
 *  cp_in_done_int_ena is set to 1.
 */
#define CP_DMA_IN_DONE_INT_ST    (BIT(0))
#define CP_DMA_IN_DONE_INT_ST_M  (CP_DMA_IN_DONE_INT_ST_V << CP_DMA_IN_DONE_INT_ST_S)
#define CP_DMA_IN_DONE_INT_ST_V  0x00000001
#define CP_DMA_IN_DONE_INT_ST_S  0
/** CP_DMA_IN_SUC_EOF_INT_ST : RO; bitpos: [1]; default: 0;
 *  This is the masked interrupt bit for cp_in_suc_eof_int interrupt when
 *  cp_in_suc_eof_int_ena is set to 1.
 */
#define CP_DMA_IN_SUC_EOF_INT_ST    (BIT(1))
#define CP_DMA_IN_SUC_EOF_INT_ST_M  (CP_DMA_IN_SUC_EOF_INT_ST_V << CP_DMA_IN_SUC_EOF_INT_ST_S)
#define CP_DMA_IN_SUC_EOF_INT_ST_V  0x00000001
#define CP_DMA_IN_SUC_EOF_INT_ST_S  1
/** CP_DMA_OUT_DONE_INT_ST : RO; bitpos: [2]; default: 0;
 *  This is the masked interrupt bit for cp_out_done_int interrupt when
 *  cp_out_done_int_ena is set to 1.
 */
#define CP_DMA_OUT_DONE_INT_ST    (BIT(2))
#define CP_DMA_OUT_DONE_INT_ST_M  (CP_DMA_OUT_DONE_INT_ST_V << CP_DMA_OUT_DONE_INT_ST_S)
#define CP_DMA_OUT_DONE_INT_ST_V  0x00000001
#define CP_DMA_OUT_DONE_INT_ST_S  2
/** CP_DMA_OUT_EOF_INT_ST : RO; bitpos: [3]; default: 0;
 *  This is the masked interrupt bit for cp_out_eof_int interrupt when
 *  cp_out_eof_int_ena is set to 1.
 */
#define CP_DMA_OUT_EOF_INT_ST    (BIT(3))
#define CP_DMA_OUT_EOF_INT_ST_M  (CP_DMA_OUT_EOF_INT_ST_V << CP_DMA_OUT_EOF_INT_ST_S)
#define CP_DMA_OUT_EOF_INT_ST_V  0x00000001
#define CP_DMA_OUT_EOF_INT_ST_S  3
/** CP_DMA_IN_DSCR_ERR_INT_ST : RO; bitpos: [4]; default: 0;
 *  This is the masked interrupt bit for cp_in_dscr_err_int interrupt when
 *  cp_in_dscr_err_int_ena is set to 1.
 */
#define CP_DMA_IN_DSCR_ERR_INT_ST    (BIT(4))
#define CP_DMA_IN_DSCR_ERR_INT_ST_M  (CP_DMA_IN_DSCR_ERR_INT_ST_V << CP_DMA_IN_DSCR_ERR_INT_ST_S)
#define CP_DMA_IN_DSCR_ERR_INT_ST_V  0x00000001
#define CP_DMA_IN_DSCR_ERR_INT_ST_S  4
/** CP_DMA_OUT_DSCR_ERR_INT_ST : RO; bitpos: [5]; default: 0;
 *  This is the masked interrupt bit for cp_out_dscr_err_int interrupt when
 *  cp_out_dscr_err_int_ena is set to 1.
 */
#define CP_DMA_OUT_DSCR_ERR_INT_ST    (BIT(5))
#define CP_DMA_OUT_DSCR_ERR_INT_ST_M  (CP_DMA_OUT_DSCR_ERR_INT_ST_V << CP_DMA_OUT_DSCR_ERR_INT_ST_S)
#define CP_DMA_OUT_DSCR_ERR_INT_ST_V  0x00000001
#define CP_DMA_OUT_DSCR_ERR_INT_ST_S  5
/** CP_DMA_IN_DSCR_EMPTY_INT_ST : RO; bitpos: [6]; default: 0;
 *  This is the masked interrupt bit for cp_in_dscr_empty_int interrupt when
 *  cp_in_dscr_empty_int_ena is set to 1.
 */
#define CP_DMA_IN_DSCR_EMPTY_INT_ST    (BIT(6))
#define CP_DMA_IN_DSCR_EMPTY_INT_ST_M  (CP_DMA_IN_DSCR_EMPTY_INT_ST_V << CP_DMA_IN_DSCR_EMPTY_INT_ST_S)
#define CP_DMA_IN_DSCR_EMPTY_INT_ST_V  0x00000001
#define CP_DMA_IN_DSCR_EMPTY_INT_ST_S  6
/** CP_DMA_OUT_TOTAL_EOF_INT_ST : RO; bitpos: [7]; default: 0;
 *  This is the masked interrupt bit for cp_out_total_eof_int interrupt when
 *  cp_out_total_eof_int_ena is set to 1.
 */
#define CP_DMA_OUT_TOTAL_EOF_INT_ST    (BIT(7))
#define CP_DMA_OUT_TOTAL_EOF_INT_ST_M  (CP_DMA_OUT_TOTAL_EOF_INT_ST_V << CP_DMA_OUT_TOTAL_EOF_INT_ST_S)
#define CP_DMA_OUT_TOTAL_EOF_INT_ST_V  0x00000001
#define CP_DMA_OUT_TOTAL_EOF_INT_ST_S  7
/** CP_DMA_CRC_DONE_INT_ST : RO; bitpos: [8]; default: 0;
 *  This is the masked interrupt bit for cp_crc_done_int interrupt when
 *  cp_crc_done_int_ena is set to 1.
 */
#define CP_DMA_CRC_DONE_INT_ST    (BIT(8))
#define CP_DMA_CRC_DONE_INT_ST_M  (CP_DMA_CRC_DONE_INT_ST_V << CP_DMA_CRC_DONE_INT_ST_S)
#define CP_DMA_CRC_DONE_INT_ST_V  0x00000001
#define CP_DMA_CRC_DONE_INT_ST_S  8

