espressif/esp-idf/components/soc/esp32s2/register/soc/cp_dma_reg.h
/** CP_DMA_INT_ENA_REG register
 *  Interrupt enable bits
 */
#define CP_DMA_INT_ENA_REG (DR_REG_CP_BASE + 0x8)
/** CP_DMA_IN_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  This is the interrupt enable bit for cp_in_done_int interrupt.
 */
#define CP_DMA_IN_DONE_INT_ENA    (BIT(0))
#define CP_DMA_IN_DONE_INT_ENA_M  (CP_DMA_IN_DONE_INT_ENA_V << CP_DMA_IN_DONE_INT_ENA_S)
#define CP_DMA_IN_DONE_INT_ENA_V  0x00000001
#define CP_DMA_IN_DONE_INT_ENA_S  0
/** CP_DMA_IN_SUC_EOF_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  This is the interrupt enable bit for cp_in_suc_eof_int interrupt.
 */
#define CP_DMA_IN_SUC_EOF_INT_ENA    (BIT(1))
#define CP_DMA_IN_SUC_EOF_INT_ENA_M  (CP_DMA_IN_SUC_EOF_INT_ENA_V << CP_DMA_IN_SUC_EOF_INT_ENA_S)
#define CP_DMA_IN_SUC_EOF_INT_ENA_V  0x00000001
#define CP_DMA_IN_SUC_EOF_INT_ENA_S  1
/** CP_DMA_OUT_DONE_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  This is the interrupt enable bit for cp_out_done_int interrupt.
 */
#define CP_DMA_OUT_DONE_INT_ENA    (BIT(2))
#define CP_DMA_OUT_DONE_INT_ENA_M  (CP_DMA_OUT_DONE_INT_ENA_V << CP_DMA_OUT_DONE_INT_ENA_S)
#define CP_DMA_OUT_DONE_INT_ENA_V  0x00000001
#define CP_DMA_OUT_DONE_INT_ENA_S  2
/** CP_DMA_OUT_EOF_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  This is the interrupt enable bit for cp_out_eof_int interrupt.
 */
#define CP_DMA_OUT_EOF_INT_ENA    (BIT(3))
#define CP_DMA_OUT_EOF_INT_ENA_M  (CP_DMA_OUT_EOF_INT_ENA_V << CP_DMA_OUT_EOF_INT_ENA_S)
#define CP_DMA_OUT_EOF_INT_ENA_V  0x00000001
#define CP_DMA_OUT_EOF_INT_ENA_S  3
/** CP_DMA_IN_DSCR_ERR_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  This is the interrupt enable bit for cp_in_dscr_err_int interrupt.
 */
#define CP_DMA_IN_DSCR_ERR_INT_ENA    (BIT(4))
#define CP_DMA_IN_DSCR_ERR_INT_ENA_M  (CP_DMA_IN_DSCR_ERR_INT_ENA_V << CP_DMA_IN_DSCR_ERR_INT_ENA_S)
#define CP_DMA_IN_DSCR_ERR_INT_ENA_V  0x00000001
#define CP_DMA_IN_DSCR_ERR_INT_ENA_S  4
/** CP_DMA_OUT_DSCR_ERR_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  This is the interrupt enable bit for cp_out_dscr_err_int interrupt.
 */
#define CP_DMA_OUT_DSCR_ERR_INT_ENA    (BIT(5))
#define CP_DMA_OUT_DSCR_ERR_INT_ENA_M  (CP_DMA_OUT_DSCR_ERR_INT_ENA_V << CP_DMA_OUT_DSCR_ERR_INT_ENA_S)
#define CP_DMA_OUT_DSCR_ERR_INT_ENA_V  0x00000001
#define CP_DMA_OUT_DSCR_ERR_INT_ENA_S  5
/** CP_DMA_IN_DSCR_EMPTY_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  This is the interrupt enable bit for cp_in_dscr_empty_int interrupt.
 */
#define CP_DMA_IN_DSCR_EMPTY_INT_ENA    (BIT(6))
#define CP_DMA_IN_DSCR_EMPTY_INT_ENA_M  (CP_DMA_IN_DSCR_EMPTY_INT_ENA_V << CP_DMA_IN_DSCR_EMPTY_INT_ENA_S)
#define CP_DMA_IN_DSCR_EMPTY_INT_ENA_V  0x00000001
#define CP_DMA_IN_DSCR_EMPTY_INT_ENA_S  6
/** CP_DMA_OUT_TOTAL_EOF_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  This is the interrupt enable bit for cp_out_total_eof_int interrupt.
 */
#define CP_DMA_OUT_TOTAL_EOF_INT_ENA    (BIT(7))
#define CP_DMA_OUT_TOTAL_EOF_INT_ENA_M  (CP_DMA_OUT_TOTAL_EOF_INT_ENA_V << CP_DMA_OUT_TOTAL_EOF_INT_ENA_S)
#define CP_DMA_OUT_TOTAL_EOF_INT_ENA_V  0x00000001
#define CP_DMA_OUT_TOTAL_EOF_INT_ENA_S  7
/** CP_DMA_CRC_DONE_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  This is the interrupt enable bit for cp_crc_done_int interrupt.
 */
#define CP_DMA_CRC_DONE_INT_ENA    (BIT(8))
#define CP_DMA_CRC_DONE_INT_ENA_M  (CP_DMA_CRC_DONE_INT_ENA_V << CP_DMA_CRC_DONE_INT_ENA_S)
#define CP_DMA_CRC_DONE_INT_ENA_V  0x00000001
#define CP_DMA_CRC_DONE_INT_ENA_S  8

/** CP_DMA_INT_CLR_REG register
 *  Interrupt clear bits
 */
#define CP_DMA_INT_CLR_REG (DR_REG_CP_BASE + 0xc)
/** CP_DMA_IN_DONE_INT_CLR : WO; bitpos: [0]; default: 0;
 *  Set this bit to clear cp_in_done_int interrupt.
 */
#define CP_DMA_IN_DONE_INT_CLR    (BIT(0))
#define CP_DMA_IN_DONE_INT_CLR_M  (CP_DMA_IN_DONE_INT_CLR_V << CP_DMA_IN_DONE_INT_CLR_S)
#define CP_DMA_IN_DONE_INT_CLR_V  0x00000001
#define CP_DMA_IN_DONE_INT_CLR_S  0
/** CP_DMA_IN_SUC_EOF_INT_CLR : WO; bitpos: [1]; default: 0;
 *  Set this bit to clear cp_in_suc_eof_int interrupt.
 */
#define CP_DMA_IN_SUC_EOF_INT_CLR    (BIT(1))
#define CP_DMA_IN_SUC_EOF_INT_CLR_M  (CP_DMA_IN_SUC_EOF_INT_CLR_V << CP_DMA_IN_SUC_EOF_INT_CLR_S)
#define CP_DMA_IN_SUC_EOF_INT_CLR_V  0x00000001
#define CP_DMA_IN_SUC_EOF_INT_CLR_S  1
/** CP_DMA_OUT_DONE_INT_CLR : WO; bitpos: [2]; default: 0;
 *  Set this bit to clear cp_out_done_int interrupt.
 */
#define CP_DMA_OUT_DONE_INT_CLR    (BIT(2))
#define CP_DMA_OUT_DONE_INT_CLR_M  (CP_DMA_OUT_DONE_INT_CLR_V << CP_DMA_OUT_DONE_INT_CLR_S)
#define CP_DMA_OUT_DONE_INT_CLR_V  0x00000001
#define CP_DMA_OUT_DONE_INT_CLR_S  2
/** CP_DMA_OUT_EOF_INT_CLR : WO; bitpos: [3]; default: 0;
 *  Set this bit to clear cp_out_eof_int interrupt.
 */
#define CP_DMA_OUT_EOF_INT_CLR    (BIT(3))
#define CP_DMA_OUT_EOF_INT_CLR_M  (CP_DMA_OUT_EOF_INT_CLR_V << CP_DMA_OUT_EOF_INT_CLR_S)
#define CP_DMA_OUT_EOF_INT_CLR_V  0x00000001
#define CP_DMA_OUT_EOF_INT_CLR_S  3
/** CP_DMA_IN_DSCR_ERR_INT_CLR : WO; bitpos: [4]; default: 0;
 *  Set this bit to clear cp_in_dscr_err_int interrupt.
 */
#define CP_DMA_IN_DSCR_ERR_INT_CLR    (BIT(4))
#define CP_DMA_IN_DSCR_ERR_INT_CLR_M  (CP_DMA_IN_DSCR_ERR_INT_CLR_V << CP_DMA_IN_DSCR_ERR_INT_CLR_S)
#define CP_DMA_IN_DSCR_ERR_INT_CLR_V  0x00000001
#define CP_DMA_IN_DSCR_ERR_INT_CLR_S  4
/** CP_DMA_OUT_DSCR_ERR_INT_CLR : WO; bitpos: [5]; default: 0;
 *  Set this bit to clear cp_out_dscr_err_int interrupt.
 */
#define CP_DMA_OUT_DSCR_ERR_INT_CLR    (BIT(5))
#define CP_DMA_OUT_DSCR_ERR_INT_CLR_M  (CP_DMA_OUT_DSCR_ERR_INT_CLR_V << CP_DMA_OUT_DSCR_ERR_INT_CLR_S)
#define CP_DMA_OUT_DSCR_ERR_INT_CLR_V  0x00000001
#define CP_DMA_OUT_DSCR_ERR_INT_CLR_S  5
/** CP_DMA_IN_DSCR_EMPTY_INT_CLR : WO; bitpos: [6]; default: 0;
 *  Set this bit to clear cp_in_dscr_empty_int interrupt.
 */
#define CP_DMA_IN_DSCR_EMPTY_INT_CLR    (BIT(6))
#define CP_DMA_IN_DSCR_EMPTY_INT_CLR_M  (CP_DMA_IN_DSCR_EMPTY_INT_CLR_V << CP_DMA_IN_DSCR_EMPTY_INT_CLR_S)
#define CP_DMA_IN_DSCR_EMPTY_INT_CLR_V  0x00000001
#define CP_DMA_IN_DSCR_EMPTY_INT_CLR_S  6
/** CP_DMA_OUT_TOTAL_EOF_INT_CLR : WO; bitpos: [7]; default: 0;
 *  Set this bit to clear cp_out_total_eof_int interrupt.
 */
#define CP_DMA_OUT_TOTAL_EOF_INT_CLR    (BIT(7))
#define CP_DMA_OUT_TOTAL_EOF_INT_CLR_M  (CP_DMA_OUT_TOTAL_EOF_INT_CLR_V << CP_DMA_OUT_TOTAL_EOF_INT_CLR_S)
#define CP_DMA_OUT_TOTAL_EOF_INT_CLR_V  0x00000001
#define CP_DMA_OUT_TOTAL_EOF_INT_CLR_S  7
/** CP_DMA_CRC_DONE_INT_CLR : WO; bitpos: [8]; default: 0;
 *  Set this bit to clear cp_crc_done_int interrupt.
 */
#define CP_DMA_CRC_DONE_INT_CLR    (BIT(8))
#define CP_DMA_CRC_DONE_INT_CLR_M  (CP_DMA_CRC_DONE_INT_CLR_V << CP_DMA_CRC_DONE_INT_CLR_S)
#define CP_DMA_CRC_DONE_INT_CLR_V  0x00000001
#define CP_DMA_CRC_DONE_INT_CLR_S  8

/** CP_DMA_OUT_LINK_REG register
 *  Link descriptor address and control
 */
#define CP_DMA_OUT_LINK_REG (DR_REG_CP_BASE + 0x10)
/** CP_DMA_OUTLINK_ADDR : R/W; bitpos: [19:0]; default: 0;
 *  This register is used to specify the least significant 20 bits of the first outlink
 *  descriptor's address.
 */
#define CP_DMA_OUTLINK_ADDR    0x000FFFFF
#define CP_DMA_OUTLINK_ADDR_M  (CP_DMA_OUTLINK_ADDR_V << CP_DMA_OUTLINK_ADDR_S)
#define CP_DMA_OUTLINK_ADDR_V  0x000FFFFF
#define CP_DMA_OUTLINK_ADDR_S  0
/** CP_DMA_OUTLINK_STOP : R/W; bitpos: [28]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptor.
 */
#define CP_DMA_OUTLINK_STOP    (BIT(28))
#define CP_DMA_OUTLINK_STOP_M  (CP_DMA_OUTLINK_STOP_V << CP_DMA_OUTLINK_STOP_S)
#define CP_DMA_OUTLINK_STOP_V  0x00000001
#define CP_DMA_OUTLINK_STOP_S  28
/** CP_DMA_OUTLINK_START : R/W; bitpos: [29]; default: 0;
 *  Set this bit to start a new outlink descriptor.
 */
#define CP_DMA_OUTLINK_START    (BIT(29))
#define CP_DMA_OUTLINK_START_M  (CP_DMA_OUTLINK_START_V << CP_DMA_OUTLINK_START_S)
#define CP_DMA_OUTLINK_START_V  0x00000001
#define CP_DMA_OUTLINK_START_S  29
/** CP_DMA_OUTLINK_RESTART : R/W; bitpos: [30]; default: 0;
 *  Set this bit to restart the outlink descriptpr from the last address.
 */
#define CP_DMA_OUTLINK_RESTART    (BIT(30))
#define CP_DMA_OUTLINK_RESTART_M  (CP_DMA_OUTLINK_RESTART_V << CP_DMA_OUTLINK_RESTART_S)
#define CP_DMA_OUTLINK_RESTART_V  0x00000001
#define CP_DMA_OUTLINK_RESTART_S  30
/** CP_DMA_OUTLINK_PARK : RO; bitpos: [31]; default: 0;
 *  1: the outlink descriptor's FSM is in idle state.
 *  0: the outlink descriptor's FSM is working.
 */
#define CP_DMA_OUTLINK_PARK    (BIT(31))
#define CP_DMA_OUTLINK_PARK_M  (CP_DMA_OUTLINK_PARK_V << CP_DMA_OUTLINK_PARK_S)
#define CP_DMA_OUTLINK_PARK_V  0x00000001
#define CP_DMA_OUTLINK_PARK_S  31

