espressif/esp-idf/components/soc/esp32s2/register/soc/cp_dma_reg.h
/** CP_DMA_IN_LINK_REG register
 *  Link descriptor address and control
 */
#define CP_DMA_IN_LINK_REG (DR_REG_CP_BASE + 0x14)
/** CP_DMA_INLINK_ADDR : R/W; bitpos: [19:0]; default: 0;
 *  This register is used to specify the least significant 20 bits of the first inlink
 *  descriptor's address.
 */
#define CP_DMA_INLINK_ADDR    0x000FFFFF
#define CP_DMA_INLINK_ADDR_M  (CP_DMA_INLINK_ADDR_V << CP_DMA_INLINK_ADDR_S)
#define CP_DMA_INLINK_ADDR_V  0x000FFFFF
#define CP_DMA_INLINK_ADDR_S  0
/** CP_DMA_INLINK_STOP : R/W; bitpos: [28]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define CP_DMA_INLINK_STOP    (BIT(28))
#define CP_DMA_INLINK_STOP_M  (CP_DMA_INLINK_STOP_V << CP_DMA_INLINK_STOP_S)
#define CP_DMA_INLINK_STOP_V  0x00000001
#define CP_DMA_INLINK_STOP_S  28
/** CP_DMA_INLINK_START : R/W; bitpos: [29]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define CP_DMA_INLINK_START    (BIT(29))
#define CP_DMA_INLINK_START_M  (CP_DMA_INLINK_START_V << CP_DMA_INLINK_START_S)
#define CP_DMA_INLINK_START_V  0x00000001
#define CP_DMA_INLINK_START_S  29
/** CP_DMA_INLINK_RESTART : R/W; bitpos: [30]; default: 0;
 *  Set this bit to restart new inlink descriptors.
 */
#define CP_DMA_INLINK_RESTART    (BIT(30))
#define CP_DMA_INLINK_RESTART_M  (CP_DMA_INLINK_RESTART_V << CP_DMA_INLINK_RESTART_S)
#define CP_DMA_INLINK_RESTART_V  0x00000001
#define CP_DMA_INLINK_RESTART_S  30
/** CP_DMA_INLINK_PARK : RO; bitpos: [31]; default: 0;
 *  1: the inlink descriptor's FSM is in idle state.
 *  0: the inlink descriptor's FSM is working.
 */
#define CP_DMA_INLINK_PARK    (BIT(31))
#define CP_DMA_INLINK_PARK_M  (CP_DMA_INLINK_PARK_V << CP_DMA_INLINK_PARK_S)
#define CP_DMA_INLINK_PARK_V  0x00000001
#define CP_DMA_INLINK_PARK_S  31

/** CP_DMA_OUT_EOF_DES_ADDR_REG register
 *  Outlink descriptor address when EOF occurs
 */
#define CP_DMA_OUT_EOF_DES_ADDR_REG (DR_REG_CP_BASE + 0x18)
/** CP_DMA_OUT_EOF_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define CP_DMA_OUT_EOF_DES_ADDR    0xFFFFFFFF
#define CP_DMA_OUT_EOF_DES_ADDR_M  (CP_DMA_OUT_EOF_DES_ADDR_V << CP_DMA_OUT_EOF_DES_ADDR_S)
#define CP_DMA_OUT_EOF_DES_ADDR_V  0xFFFFFFFF
#define CP_DMA_OUT_EOF_DES_ADDR_S  0

/** CP_DMA_IN_EOF_DES_ADDR_REG register
 *  Inlink descriptor address when EOF occurs
 */
#define CP_DMA_IN_EOF_DES_ADDR_REG (DR_REG_CP_BASE + 0x1c)
/** CP_DMA_IN_SUC_EOF_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when received successful
 *  EOF.
 */
#define CP_DMA_IN_SUC_EOF_DES_ADDR    0xFFFFFFFF
#define CP_DMA_IN_SUC_EOF_DES_ADDR_M  (CP_DMA_IN_SUC_EOF_DES_ADDR_V << CP_DMA_IN_SUC_EOF_DES_ADDR_S)
#define CP_DMA_IN_SUC_EOF_DES_ADDR_V  0xFFFFFFFF
#define CP_DMA_IN_SUC_EOF_DES_ADDR_S  0

/** CP_DMA_OUT_EOF_BFR_DES_ADDR_REG register
 *  Outlink descriptor address before the last outlink descriptor
 */
#define CP_DMA_OUT_EOF_BFR_DES_ADDR_REG (DR_REG_CP_BASE + 0x20)
/** CP_DMA_OUT_EOF_BFR_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor before the last outlink
 *  descriptor.
 */
#define CP_DMA_OUT_EOF_BFR_DES_ADDR    0xFFFFFFFF
#define CP_DMA_OUT_EOF_BFR_DES_ADDR_M  (CP_DMA_OUT_EOF_BFR_DES_ADDR_V << CP_DMA_OUT_EOF_BFR_DES_ADDR_S)
#define CP_DMA_OUT_EOF_BFR_DES_ADDR_V  0xFFFFFFFF
#define CP_DMA_OUT_EOF_BFR_DES_ADDR_S  0

/** CP_DMA_INLINK_DSCR_REG register
 *  Address of current inlink descriptor
 */
#define CP_DMA_INLINK_DSCR_REG (DR_REG_CP_BASE + 0x24)
/** CP_DMA_INLINK_DSCR : RO; bitpos: [31:0]; default: 0;
 *  The address of the current inlink descriptor x.
 */
#define CP_DMA_INLINK_DSCR    0xFFFFFFFF
#define CP_DMA_INLINK_DSCR_M  (CP_DMA_INLINK_DSCR_V << CP_DMA_INLINK_DSCR_S)
#define CP_DMA_INLINK_DSCR_V  0xFFFFFFFF
#define CP_DMA_INLINK_DSCR_S  0

/** CP_DMA_INLINK_DSCR_BF0_REG register
 *  Address of last inlink descriptor
 */
#define CP_DMA_INLINK_DSCR_BF0_REG (DR_REG_CP_BASE + 0x28)
/** CP_DMA_INLINK_DSCR_BF0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor x-1.
 */
#define CP_DMA_INLINK_DSCR_BF0    0xFFFFFFFF
#define CP_DMA_INLINK_DSCR_BF0_M  (CP_DMA_INLINK_DSCR_BF0_V << CP_DMA_INLINK_DSCR_BF0_S)
#define CP_DMA_INLINK_DSCR_BF0_V  0xFFFFFFFF
#define CP_DMA_INLINK_DSCR_BF0_S  0

/** CP_DMA_INLINK_DSCR_BF1_REG register
 *  Address of the second-to-last inlink descriptor
 */
#define CP_DMA_INLINK_DSCR_BF1_REG (DR_REG_CP_BASE + 0x2c)
/** CP_DMA_INLINK_DSCR_BF1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor x-2.
 */
#define CP_DMA_INLINK_DSCR_BF1    0xFFFFFFFF
#define CP_DMA_INLINK_DSCR_BF1_M  (CP_DMA_INLINK_DSCR_BF1_V << CP_DMA_INLINK_DSCR_BF1_S)
#define CP_DMA_INLINK_DSCR_BF1_V  0xFFFFFFFF
#define CP_DMA_INLINK_DSCR_BF1_S  0

/** CP_DMA_OUTLINK_DSCR_REG register
 *  Address of current outlink descriptor
 */
#define CP_DMA_OUTLINK_DSCR_REG (DR_REG_CP_BASE + 0x30)
/** CP_DMA_OUTLINK_DSCR : RO; bitpos: [31:0]; default: 0;
 *  The address of the current outlink descriptor y.
 */
#define CP_DMA_OUTLINK_DSCR    0xFFFFFFFF
#define CP_DMA_OUTLINK_DSCR_M  (CP_DMA_OUTLINK_DSCR_V << CP_DMA_OUTLINK_DSCR_S)
#define CP_DMA_OUTLINK_DSCR_V  0xFFFFFFFF
#define CP_DMA_OUTLINK_DSCR_S  0

/** CP_DMA_OUTLINK_DSCR_BF0_REG register
 *  Address of last outlink descriptor
 */
#define CP_DMA_OUTLINK_DSCR_BF0_REG (DR_REG_CP_BASE + 0x34)
/** CP_DMA_OUTLINK_DSCR_BF0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor y-1.
 */
#define CP_DMA_OUTLINK_DSCR_BF0    0xFFFFFFFF
#define CP_DMA_OUTLINK_DSCR_BF0_M  (CP_DMA_OUTLINK_DSCR_BF0_V << CP_DMA_OUTLINK_DSCR_BF0_S)
#define CP_DMA_OUTLINK_DSCR_BF0_V  0xFFFFFFFF
#define CP_DMA_OUTLINK_DSCR_BF0_S  0

/** CP_DMA_OUTLINK_DSCR_BF1_REG register
 *  Address of the second-to-last outlink descriptor
 */
#define CP_DMA_OUTLINK_DSCR_BF1_REG (DR_REG_CP_BASE + 0x38)
/** CP_DMA_OUTLINK_DSCR_BF1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor y-2.
 */
#define CP_DMA_OUTLINK_DSCR_BF1    0xFFFFFFFF
#define CP_DMA_OUTLINK_DSCR_BF1_M  (CP_DMA_OUTLINK_DSCR_BF1_V << CP_DMA_OUTLINK_DSCR_BF1_S)
#define CP_DMA_OUTLINK_DSCR_BF1_V  0xFFFFFFFF
#define CP_DMA_OUTLINK_DSCR_BF1_S  0

/** CP_DMA_CONF_REG register
 *  Copy DMA configuration register
 */
#define CP_DMA_CONF_REG (DR_REG_CP_BASE + 0x3c)
/** CP_DMA_IN_RST : R/W; bitpos: [0]; default: 0;
 *  Set this bit to reset in_inf state machine.
 */
#define CP_DMA_IN_RST    (BIT(0))
#define CP_DMA_IN_RST_M  (CP_DMA_IN_RST_V << CP_DMA_IN_RST_S)
#define CP_DMA_IN_RST_V  0x00000001
#define CP_DMA_IN_RST_S  0
/** CP_DMA_OUT_RST : R/W; bitpos: [1]; default: 0;
 *  Set this bit to reset out_inf state machine.
 */
#define CP_DMA_OUT_RST    (BIT(1))
#define CP_DMA_OUT_RST_M  (CP_DMA_OUT_RST_V << CP_DMA_OUT_RST_S)
#define CP_DMA_OUT_RST_V  0x00000001
#define CP_DMA_OUT_RST_S  1
/** CP_DMA_CMDFIFO_RST : R/W; bitpos: [2]; default: 0;
 *  Set this bit to reset in_cmd fifo and out_cmd fifo.
 */
#define CP_DMA_CMDFIFO_RST    (BIT(2))
#define CP_DMA_CMDFIFO_RST_M  (CP_DMA_CMDFIFO_RST_V << CP_DMA_CMDFIFO_RST_S)
#define CP_DMA_CMDFIFO_RST_V  0x00000001
#define CP_DMA_CMDFIFO_RST_S  2
/** CP_DMA_FIFO_RST : R/W; bitpos: [3]; default: 0;
 *  Set this bit to reset data in receive FIFO.
 */
#define CP_DMA_FIFO_RST    (BIT(3))
#define CP_DMA_FIFO_RST_M  (CP_DMA_FIFO_RST_V << CP_DMA_FIFO_RST_S)
#define CP_DMA_FIFO_RST_V  0x00000001
#define CP_DMA_FIFO_RST_S  3
/** CP_DMA_OUT_OWNER : R/W; bitpos: [4]; default: 0;
 *  This is used to configure the owner bit in OUT descriptor. This is effective only
 *  when you set reg_out_auto_wrback.
 */
#define CP_DMA_OUT_OWNER    (BIT(4))
#define CP_DMA_OUT_OWNER_M  (CP_DMA_OUT_OWNER_V << CP_DMA_OUT_OWNER_S)
#define CP_DMA_OUT_OWNER_V  0x00000001
#define CP_DMA_OUT_OWNER_S  4
/** CP_DMA_IN_OWNER : R/W; bitpos: [5]; default: 0;
 *  This is used to configure the owner bit in IN descriptor.
 */
#define CP_DMA_IN_OWNER    (BIT(5))
#define CP_DMA_IN_OWNER_M  (CP_DMA_IN_OWNER_V << CP_DMA_IN_OWNER_S)
#define CP_DMA_IN_OWNER_V  0x00000001
#define CP_DMA_IN_OWNER_S  5
/** CP_DMA_OUT_AUTO_WRBACK : R/W; bitpos: [6]; default: 0;
 *  This bit is used to write back out descriptor when hardware has already used this
 *  descriptor.
 */
#define CP_DMA_OUT_AUTO_WRBACK    (BIT(6))
#define CP_DMA_OUT_AUTO_WRBACK_M  (CP_DMA_OUT_AUTO_WRBACK_V << CP_DMA_OUT_AUTO_WRBACK_S)
#define CP_DMA_OUT_AUTO_WRBACK_V  0x00000001
#define CP_DMA_OUT_AUTO_WRBACK_S  6
/** CP_DMA_CHECK_OWNER : R/W; bitpos: [7]; default: 0;
 *  Set this bit to enable owner bit check in descriptor.
 */
#define CP_DMA_CHECK_OWNER    (BIT(7))
#define CP_DMA_CHECK_OWNER_M  (CP_DMA_CHECK_OWNER_V << CP_DMA_CHECK_OWNER_S)
#define CP_DMA_CHECK_OWNER_V  0x00000001
#define CP_DMA_CHECK_OWNER_S  7
/** CP_DMA_CRC_CAL_RESET : R/W; bitpos: [8]; default: 0;
 *  Set this bit to reset crc calculation.
 */
#define CP_DMA_CRC_CAL_RESET    (BIT(8))
#define CP_DMA_CRC_CAL_RESET_M  (CP_DMA_CRC_CAL_RESET_V << CP_DMA_CRC_CAL_RESET_S)
#define CP_DMA_CRC_CAL_RESET_V  0x00000001
#define CP_DMA_CRC_CAL_RESET_S  8
/** CP_DMA_CRC_CAL_EN : R/W; bitpos: [9]; default: 0;
 *  Set this bit enable crc calculation function.
 */
#define CP_DMA_CRC_CAL_EN    (BIT(9))
#define CP_DMA_CRC_CAL_EN_M  (CP_DMA_CRC_CAL_EN_V << CP_DMA_CRC_CAL_EN_S)
#define CP_DMA_CRC_CAL_EN_V  0x00000001
#define CP_DMA_CRC_CAL_EN_S  9
/** CP_DMA_CRC_BIG_ENDIAN_EN : R/W; bitpos: [10]; default: 0;
 *  Set this bit to reorder the bit of data which will be send to execute crc.
 */
#define CP_DMA_CRC_BIG_ENDIAN_EN    (BIT(10))
#define CP_DMA_CRC_BIG_ENDIAN_EN_M  (CP_DMA_CRC_BIG_ENDIAN_EN_V << CP_DMA_CRC_BIG_ENDIAN_EN_S)
#define CP_DMA_CRC_BIG_ENDIAN_EN_V  0x00000001
#define CP_DMA_CRC_BIG_ENDIAN_EN_S  10
/** CP_DMA_CRC_OUT_REVERSE_EN : R/W; bitpos: [11]; default: 0;
 *  Set this bit to reverse the crc calculation result.
 */
#define CP_DMA_CRC_OUT_REVERSE_EN    (BIT(11))
#define CP_DMA_CRC_OUT_REVERSE_EN_M  (CP_DMA_CRC_OUT_REVERSE_EN_V << CP_DMA_CRC_OUT_REVERSE_EN_S)
#define CP_DMA_CRC_OUT_REVERSE_EN_V  0x00000001
#define CP_DMA_CRC_OUT_REVERSE_EN_S  11
/** CP_DMA_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  1'b1: Force clock on for register. 1'b0: Support clock only when application writes
 *  registers.
 */
#define CP_DMA_CLK_EN    (BIT(31))
#define CP_DMA_CLK_EN_M  (CP_DMA_CLK_EN_V << CP_DMA_CLK_EN_S)
#define CP_DMA_CLK_EN_V  0x00000001
#define CP_DMA_CLK_EN_S  31

/** CP_DMA_IN_ST_REG register
 *  Status register of receiving data
 */
#define CP_DMA_IN_ST_REG (DR_REG_CP_BASE + 0x40)
/** CP_DMA_INLINK_DSCR_ADDR : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define CP_DMA_INLINK_DSCR_ADDR    0x0003FFFF
#define CP_DMA_INLINK_DSCR_ADDR_M  (CP_DMA_INLINK_DSCR_ADDR_V << CP_DMA_INLINK_DSCR_ADDR_S)
#define CP_DMA_INLINK_DSCR_ADDR_V  0x0003FFFF
#define CP_DMA_INLINK_DSCR_ADDR_S  0
/** CP_DMA_IN_DSCR_STATE : RO; bitpos: [19:18]; default: 0;
 *  Reserved.
 */
#define CP_DMA_IN_DSCR_STATE    0x00000003
#define CP_DMA_IN_DSCR_STATE_M  (CP_DMA_IN_DSCR_STATE_V << CP_DMA_IN_DSCR_STATE_S)
#define CP_DMA_IN_DSCR_STATE_V  0x00000003
#define CP_DMA_IN_DSCR_STATE_S  18
/** CP_DMA_IN_STATE : RO; bitpos: [22:20]; default: 0;
 *  Reserved.
 */
#define CP_DMA_IN_STATE    0x00000007
#define CP_DMA_IN_STATE_M  (CP_DMA_IN_STATE_V << CP_DMA_IN_STATE_S)
#define CP_DMA_IN_STATE_V  0x00000007
#define CP_DMA_IN_STATE_S  20
/** CP_DMA_FIFO_EMPTY : RO; bitpos: [23]; default: 0;
 *  Copy DMA FIFO empty signal.
 */
#define CP_DMA_FIFO_EMPTY    (BIT(23))
#define CP_DMA_FIFO_EMPTY_M  (CP_DMA_FIFO_EMPTY_V << CP_DMA_FIFO_EMPTY_S)
#define CP_DMA_FIFO_EMPTY_V  0x00000001
#define CP_DMA_FIFO_EMPTY_S  23

