espressif/esp-idf/components/soc/esp32s2/register/soc/cp_dma_reg.h
/** CP_DMA_OUT_ST_REG register
 *  Status register of transmitting data
 */
#define CP_DMA_OUT_ST_REG (DR_REG_CP_BASE + 0x44)
/** CP_DMA_OUTLINK_DSCR_ADDR : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define CP_DMA_OUTLINK_DSCR_ADDR    0x0003FFFF
#define CP_DMA_OUTLINK_DSCR_ADDR_M  (CP_DMA_OUTLINK_DSCR_ADDR_V << CP_DMA_OUTLINK_DSCR_ADDR_S)
#define CP_DMA_OUTLINK_DSCR_ADDR_V  0x0003FFFF
#define CP_DMA_OUTLINK_DSCR_ADDR_S  0
/** CP_DMA_OUT_DSCR_STATE : RO; bitpos: [19:18]; default: 0;
 *  Reserved.
 */
#define CP_DMA_OUT_DSCR_STATE    0x00000003
#define CP_DMA_OUT_DSCR_STATE_M  (CP_DMA_OUT_DSCR_STATE_V << CP_DMA_OUT_DSCR_STATE_S)
#define CP_DMA_OUT_DSCR_STATE_V  0x00000003
#define CP_DMA_OUT_DSCR_STATE_S  18
/** CP_DMA_OUT_STATE : RO; bitpos: [22:20]; default: 0;
 *  Reserved.
 */
#define CP_DMA_OUT_STATE    0x00000007
#define CP_DMA_OUT_STATE_M  (CP_DMA_OUT_STATE_V << CP_DMA_OUT_STATE_S)
#define CP_DMA_OUT_STATE_V  0x00000007
#define CP_DMA_OUT_STATE_S  20
/** CP_DMA_FIFO_FULL : RO; bitpos: [23]; default: 0;
 *  Copy DMA FIFO full signal.
 */
#define CP_DMA_FIFO_FULL    (BIT(23))
#define CP_DMA_FIFO_FULL_M  (CP_DMA_FIFO_FULL_V << CP_DMA_FIFO_FULL_S)
#define CP_DMA_FIFO_FULL_V  0x00000001
#define CP_DMA_FIFO_FULL_S  23

/** CP_DMA_CRC_OUT_REG register
 *  CRC result register
 */
#define CP_DMA_CRC_OUT_REG (DR_REG_CP_BASE + 0x48)
/** CP_DMA_CRC_RESULT : RO; bitpos: [31:0]; default: 0;
 *  This register stores the result of CRC.
 */
#define CP_DMA_CRC_RESULT    0xFFFFFFFF
#define CP_DMA_CRC_RESULT_M  (CP_DMA_CRC_RESULT_V << CP_DMA_CRC_RESULT_S)
#define CP_DMA_CRC_RESULT_V  0xFFFFFFFF
#define CP_DMA_CRC_RESULT_S  0

/** CP_DMA_DATE_REG register
 *  Copy DMA version register
 */
#define CP_DMA_DATE_REG (DR_REG_CP_BASE + 0xfc)
/** CP_DMA_DMA_DATE : R/W; bitpos: [31:0]; default: 403185664;
 *  This is the version register.
 */
#define CP_DMA_DMA_DATE    0xFFFFFFFF
#define CP_DMA_DMA_DATE_M  (CP_DMA_DMA_DATE_V << CP_DMA_DMA_DATE_S)
#define CP_DMA_DMA_DATE_V  0xFFFFFFFF
#define CP_DMA_DMA_DATE_S  0

#ifdef __cplusplus
}
#endif
